package com.openGL.csdn.bean;

public class Constant {
	/** 顶点数量 */
	public static final int VERTEX_COUNT = 36;

	/** 色子空间顶点 */
	public static final float[] VERTEX_COORD = new float[]{
		0,1,0,	0,1,1,	1,1,0,	1,1,1,	0,1,1,	1,1,0,							
		
		0,0,0,	0,0,1,	0,1,0,	0,1,1,	0,0,1,	0,1,0,	
		
		0,0,0,	0,0,1,	1,0,0,	1,0,1,	0,0,1,	1,0,0,
		
		1,0,0,	1,0,1,	1,1,0,	1,1,1,	1,0,1,	1,1,0,
		
		0,0,1,	1,0,1,	0,1,1,	1,1,1,	1,0,1,	0,1,1,
		
		0,0,0,	1,0,0,	0,1,0,	1,1,0,	1,0,0,	0,1,0,
	};
	/** 色子顶点法向量 */
	public static final float[] NORMALS_COORD = new float[]{
		0,1,0,	0,1,0,	0,1,0,	0,1,0,	0,1,0,	0,1,0,								//Y+
		-1,0,0,	-1,0,0,	-1,0,0,	-1,0,0,	-1,0,0,	-1,0,0,								//X-
		0,-1,0,	0,-1,0,	0,-1,0,	0,-1,0,	0,-1,0,	0,-1,0,								//Y-
		1,0,0,	1,0,0,	1,0,0,	1,0,0,	1,0,0,	1,0,0,								//X+
		0,0,1,	0,0,1,	0,0,1,	0,0,1,	0,0,1,	0,0,1,								//Z+
		0,0,-1,	0,0,-1,	0,0,-1,	0,0,-1,	0,0,-1,	0,0,-1,								//Z-
	};
	/** 色子顶点贴图坐标 */
	public static final float[] TEXTURE_COORD = new float[]{
		2,3,		1,3,		2,4,		1,4,		1,3,		2,4,								//3点
		2,2,		1,2,		2,3,		1,3,		1,2,		2,3,								//5点
		2,2,		1,2,		2,1,		1,1,		1,2,		2,1,								//4点
		2,1,		1,1,		2,0,		1,0,		1,1,		2,0,								//1点
		1,2,		0,2,		1,3,		0,3,		0,2,		1,3,								//2点
		2,2,		3,2,		2,3,		3,3,		3,2,		2,3,								//6点
	};
	//使用静态代码块对数据进行偏移更正；
	static{
		//GL的位图采用ST坐标，范围（0-1），要做调整
		for(int i=0;i<TEXTURE_COORD.length;i++){
			TEXTURE_COORD[i] = TEXTURE_COORD[i]/4;
		}
		//将色子中心移动到坐标原点
		for(int i=0;i<VERTEX_COORD.length;i++){
			VERTEX_COORD[i] = VERTEX_COORD[i]-0.5f;
		}
	}

}
